<a href="https://colab.research.google.com/github/gtzambranop/UN_2020_2/blob/DCD/DCD/module_2/basic_python_class_06.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **"Pyhton Básico"**

* **Profesor:** Francisco Javier Ospina Salazar
* **Monitoras:**
  - Diana Carolina Sanchez Perez
  - Guiselle Tatiana Zambrano Penagos
* **Fechas:** 
  - Inicio: 2020-09-12
  - Final: 2020-09-29
* [Presentación del curso](http://34.221.75.109/#/)


## Contenido de la clase

- Operaciones entre tablas de datos
  - Joins (uniones)
- Creación de filas o columnas en tablas
  - Añadir columas
  - Broadcasting
  - Añadir filas
  - Concatenación
- Operaciones útiles con DataFrames
  - Multi-indexamiento
    - Agregaciones por niveles de indexamiento
  - Tablas pivote
  - Selección de sub-dataframes
  - Ordenamientos
  - Iteraciones sobre grupos
  - Agregaciones sobre grupos
  - Tablas cruzadas

# Informacióón adicional

## Diferencia entre métodos y funciones

Una **función** es una pieza de código que se llama por nombre. Se puede pasar datos para operar (es decir, los parámetros) y opcionalmente puede devolver datos (el valor de retorno). Todos los datos que se pasan a una función se pasan explícitamente. 

Un **método** es una porción de código que es llamado por un nombre que está asociado con un objeto. En la mayoría de los aspectos, es idéntica a una función, excepto por dos diferencias clave:

- Un método se pasa implícitamente al objeto sobre el que se llamó.
- Un método puede operar con datos contenidos en la clase (recordando que un objeto es una instancia de una clase, la clase es la definición, el objeto es una instancia de esa información).

Una **función** puede retornar un resultado o realizar una accióón agena al objeto. Un **método** modifica y trabaja directamente con el objeto.

### Ejemplo método

In [ ]:
# Se define un diccionario
dc = {'a': 1}
dc

{'a': 1}

In [ ]:
# El método update actualiza el diccionario directamente
dc.update({'b': 2})
dc

{'a': 1, 'b': 2}

In [ ]:
def exponentiation_method(list_base, exponent=2):
  # Se sobrescriben los datos de list_base
  for i in range(len(list_base)):
    list_base[i] = list_base[i] ** exponent

In [ ]:
# Lista de números pares en el rango [0, 10)
list_1 = list(range(0, 10, 2)) 
print(list_1)

[0, 2, 4, 6, 8]

In [ ]:
exponentiation_method(list_1)

In [ ]:
# Se modificó directamente la lista original
list_1

[0, 4, 16, 36, 64]

### Ejemplo función

In [ ]:
# Lista de números pares en el rango [0, 10)
list_1 = list(range(0, 10, 2)) 
print(list_1)

[0, 2, 4, 6, 8]

In [ ]:
def exponentiation_function(list_base, exponent=2):
  # Se crea una nueva lista, la lista de entrada NO se modifica
  list_2 = [x**exponent for x in list_base]
  return list_2

In [ ]:
# La lista original no se modifica, pero se retorna una nueva lista con los
# cambios requeridos
list_2 = exponentiation_function(list_1, 3)
list_2

[0, 16, 256, 1296, 4096]

In [ ]:
list_1

[0, 2, 4, 6, 8]

In [ ]:
exponentiation_2(list_1, 2)

In [ ]:
# La lista original se modificó
list_1

[0, 4, 16, 36, 64]

In [ ]:
import pandas as pd 
import numpy as np

# Operaciones de tablas en Pandas

## Operaciones entre tablas de datos
* Joins
* Concatenación de tablas
  * Añadir columas
  * Añadir filas

### Joins

**Nota:** 


Como ejemplos para ver la funcionalidad de los joins se tomaran las tablas que se usan como ejemplo en la sección de [joins de Wikipedia](https://es.wikipedia.org/wiki/Join)

![join](https://ingenieriadesoftware.es/wp-content/uploads/2018/07/sqljoin.jpeg)

In [ ]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})


Departamento = pd.DataFrame({'NombreDepartamento': ['Ventas', 'Ingeniería', 'Producción', 'Mercadeo'],
                             'IDDepartamento': [31, 33, 34, 35]})

In [ ]:
print(Empleado)
print('-' * 50)
print(Departamento)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
--------------------------------------------------
  NombreDepartamento  IDDepartamento
0             Ventas              31
1         Ingeniería              33
2         Producción              34
3           Mercadeo              35

#### Inner join.

El inner join mezcla las dos tablas por columna dejando únicamente las filas que hacen **match** en ambas tablas. Inner es el join por defecto en Pandas.

In [ ]:
pd.merge(Empleado, Departamento) # La columna IDDepartamento solo queda una vez

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción

In [ ]:
Empleado.merge(Departamento) # Forma alterna

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción

#### Left join

El left join mezcla las dos tablas por columna, dejando todas las filas de la tabla izquierda y solo las de la derecha que hacen match; el resto de registros lo llena con nulos.

In [ ]:
# Se hace la operacióón left y luego el resultado es asignado a df_merged
df_merged = pd.merge(Empleado, Departamento, how='left') 
df_merged

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5     Gaspar              36                NaN

#### Right join

El Right join mezcla las dos tablas por columna, dejando todas las filas de la tabla derecha y solo las de la izquierda que hacen match; el resto de registros lo llena con nulos.

In [ ]:
pd.merge(Empleado, Departamento, how='right')

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5        NaN              35           Mercadeo

#### Outer join (Full outer join)
El Outer join mezcla las dos tablas por columna, dejando todas las filas de ambas tablas independientemente si hay match o no.

In [ ]:
pd.merge(Empleado, Departamento, how='outer')

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5     Gaspar              36                NaN
6        NaN              35           Mercadeo

#### Full join

El Full join mezcla las dos tablas por columna, dejando solo las filas de ambas tablas que no hicieron match.

In [ ]:
df_merged = pd.merge(Empleado, Departamento, how='outer')
# Retorna lo que no hizo match
df_merged[np.logical_or(df_merged.Apellido.isna(), df_merged.NombreDepartamento.isna())]

  Apellido  IDDepartamento NombreDepartamento
5   Gaspar              36                NaN
6      NaN              35           Mercadeo

#### Algunas funcionalidades adicionales de todos los joins dentro de pandas

In [ ]:
# Decidir la columna por la cual se hace el join explicitamente
Empleado.columns = ['Nombre', 'IDDepartamento']
Departamento.columns = ['Nombre', 'IDDepartamento']

In [ ]:
print(Empleado)
print('-' * 50)
print(Departamento)

      Nombre  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
--------------------------------------------------
       Nombre  IDDepartamento
0      Ventas              31
1  Ingeniería              33
2  Producción              34
3    Mercadeo              35

In [ ]:
pd.merge(Empleado, Departamento)

Empty DataFrame
Columns: [Nombre, IDDepartamento]
Index: []

In [ ]:
pd.merge(Empleado, Departamento, on='IDDepartamento') # En caso de haber múltiples columnas que hagan match

    Nombre_x  IDDepartamento    Nombre_y
0    Andrade              31      Ventas
1     Jordán              33  Ingeniería
2  Steinberg              33  Ingeniería
3   Róbinson              34  Producción
4     Zolano              34  Producción

In [ ]:
# Prefijos para distiguir variables
pd.merge(Empleado, Departamento, on='IDDepartamento', suffixes=('_emp','_dep')) # Sufijo personalizado

  Nombre_emp  IDDepartamento  Nombre_dep
0    Andrade              31      Ventas
1     Jordán              33  Ingeniería
2  Steinberg              33  Ingeniería
3   Róbinson              34  Producción
4     Zolano              34  Producción

In [ ]:
# Columnas para match con diferente nombre
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})


Departamento = pd.DataFrame({'NombreDepartamento': ['Ventas', 'Ingeniería', 'Producción', 'Mercadeo'],
                             'IDDepartamento2': [31, 33, 34, 35]})
print(Empleado)
print(Departamento)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
  NombreDepartamento  IDDepartamento2
0             Ventas               31
1         Ingeniería               33
2         Producción               34
3           Mercadeo               35

In [ ]:
# Error, no hay nada igual entre ambas tablas
#pd.merge(Empleado, Departamento)

In [ ]:
pd.merge(Empleado, Departamento, left_on='IDDepartamento', right_on='IDDepartamento2')

    Apellido  IDDepartamento NombreDepartamento  IDDepartamento2
0    Andrade              31             Ventas               31
1     Jordán              33         Ingeniería               33
2  Steinberg              33         Ingeniería               33
3   Róbinson              34         Producción               34
4     Zolano              34         Producción               34

##### Join por la indexación

In [ ]:
Empleado2 = Empleado.copy()
Empleado2.index = Empleado2.IDDepartamento
Empleado2

                 Apellido  IDDepartamento
IDDepartamento
31                Andrade              31
33                 Jordán              33
33              Steinberg              33
34               Róbinson              34
34                 Zolano              34
36                 Gaspar              36

In [ ]:
Departamento2 = Departamento.copy()
Departamento2.index = Departamento2.IDDepartamento2
Departamento2

                NombreDepartamento  IDDepartamento2
IDDepartamento2
31                          Ventas               31
33                      Ingeniería               33
34                      Producción               34
35                        Mercadeo               35

In [ ]:
Empleado2 = Empleado2[['Apellido']]
Empleado2

                 Apellido
IDDepartamento
31                Andrade
33                 Jordán
33              Steinberg
34               Róbinson
34                 Zolano
36                 Gaspar

In [ ]:
Departamento2 = Departamento2[['NombreDepartamento']]
Departamento2

                NombreDepartamento
IDDepartamento2
31                          Ventas
33                      Ingeniería
34                      Producción
35                        Mercadeo

In [ ]:
print(Empleado)
print('-' * 35)
print(Departamento)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
-----------------------------------
  NombreDepartamento  IDDepartamento2
0             Ventas               31
1         Ingeniería               33
2         Producción               34
3           Mercadeo               35

In [ ]:
print(Empleado2)
print('-' * 35)
print(Departamento2)

                 Apellido
IDDepartamento
31                Andrade
33                 Jordán
33              Steinberg
34               Róbinson
34                 Zolano
36                 Gaspar
-----------------------------------
                NombreDepartamento
IDDepartamento2
31                          Ventas
33                      Ingeniería
34                      Producción
35                        Mercadeo

In [ ]:
pd.merge(Empleado2, Departamento2, left_index=True, right_index=True)

     Apellido NombreDepartamento
31    Andrade             Ventas
33     Jordán         Ingeniería
33  Steinberg         Ingeniería
34   Róbinson         Producción
34     Zolano         Producción

## Añadir filas o columnas a dataframes DataFrames y Series
* Por inserción directa
* Por Concatenación

In [ ]:
# Añadir columna

Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
Empleado

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [ ]:
nombres = ['Francisco', 'Edgar', 'Marta', 'Luciana', 'David', 'María']

# Asignación creando un objeto nuevo
Empleado2 = Empleado.assign(Nombre=nombres)
Empleado2

# Asignación modificando el objeto original
#Empleado['Nombre'] = nombres
#Empleado

    Apellido  IDDepartamento     Nombre
0    Andrade              31  Francisco
1     Jordán              33      Edgar
2  Steinberg              33      Marta
3   Róbinson              34    Luciana
4     Zolano              34      David
5     Gaspar              36      María

In [ ]:
# Se ordenan las columnas de la tabla y se asigna el resultado de la tabla
# ordenada a Empleado3
Empleado3 = Empleado2[['Nombre', 'Apellido', 'IDDepartamento']]
Empleado3

      Nombre   Apellido  IDDepartamento
0  Francisco    Andrade              31
1      Edgar     Jordán              33
2      Marta  Steinberg              33
3    Luciana   Róbinson              34
4      David     Zolano              34
5      María     Gaspar              36

In [ ]:
# No se modifica la tabla original
Empleado2

    Apellido  IDDepartamento     Nombre
0    Andrade              31  Francisco
1     Jordán              33      Edgar
2  Steinberg              33      Marta
3   Róbinson              34    Luciana
4     Zolano              34      David
5     Gaspar              36      María

In [ ]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento     Nombre
0    Andrade              31  Francisco
1     Jordán              33      Edgar
2  Steinberg              33      Marta
3   Róbinson              34    Luciana
4     Zolano              34      David
5     Gaspar              36      María
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [ ]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
Empleado

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [ ]:
nuevo_empleado = [('Ospina', 33)]
  
# Asignación creando un objeto nuevo
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)
Empleado2

    Apellido  IDDepartamento       0     1
0    Andrade            31.0     NaN   NaN
1     Jordán            33.0     NaN   NaN
2  Steinberg            33.0     NaN   NaN
3   Róbinson            34.0     NaN   NaN
4     Zolano            34.0     NaN   NaN
5     Gaspar            36.0     NaN   NaN
6        NaN             NaN  Ospina  33.0

In [ ]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
nuevo_empleado = [{'Apellido': 'Ospina', 'IDDepartamento': 33}]

# Asignación creando un objeto nuevo
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)
Empleado2

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              33

In [ ]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})

# Asignación creando un objeto nuevo
nuevo_empleado = pd.Series(['Ospina', 37], index=['Apellido', 'IDDepartamento'])
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)
Empleado2

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37

In [ ]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})

# Asignación modificando el objeto original
Empleado.loc[6] = ['Ospina', 37]
Empleado

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37

In [ ]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37

In [ ]:
# Corregir la ubicacion de los nuevos datos
# Sin embargo se conserva el problema del indice '0'
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
nuevo_empleado = [{'Apellido': 'Ospina', 'IDDepartamento': 33}]

print(nuevo_empleado)

Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)

[{'Apellido': 'Ospina', 'IDDepartamento': 33}]

In [ ]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              33
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [ ]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})

nuevo_empleado = pd.Series(['Ospina', 37], index=['Apellido', 'IDDepartamento'])
print(nuevo_empleado)
print(nuevo_empleado.index)
# Asignación creando un objeto nuevo
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)

Apellido          Ospina
IDDepartamento        37
dtype: object
Index(['Apellido', 'IDDepartamento'], dtype='object')

In [ ]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [ ]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})

nuevo_empleado = pd.Series(['Ospina'], index=['Apellido'])
print(nuevo_empleado)
print(nuevo_empleado.index)
# Asignación creando un objeto nuevo
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)

Apellido    Ospina
dtype: object
Index(['Apellido'], dtype='object')

In [ ]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento
0    Andrade            31.0
1     Jordán            33.0
2  Steinberg            33.0
3   Róbinson            34.0
4     Zolano            34.0
5     Gaspar            36.0
6     Ospina             NaN
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [ ]:
# Asignación modificando el objeto original
Empleado.loc[6] = ['Ospina', 37]
Empleado

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37

## Boadcasting con Dataframes

In [ ]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
Departamento = pd.DataFrame({'NombreDepartamento': ['Ventas', 'Ingeniería', 'Producción', 'Mercadeo'],
                             'IDDepartamento': [31, 33, 34, 35]})

Empleado['Edad'] = [20,23,45,48,56,32]

Empleado['Edad_meses'] = Empleado['Edad'] * 12

Empleado.drop(5)

    Apellido  IDDepartamento  Edad  Edad_meses
0    Andrade              31    20         240
1     Jordán              33    23         276
2  Steinberg              33    45         540
3   Róbinson              34    48         576
4     Zolano              34    56         672

### ¿Cuándo no usar Broadcasting?

No se usa broadcasting cuando la operación es compleja

In [ ]:
df_merge = pd.merge(Empleado, Departamento, how='left')

str_list = []

for index, row in df_merge.iterrows():
    str_list.append('El empleado {} trabaja en el departamento de {}'.format(row['Apellido'], 
                                                                             row['IDDepartamento']))
    
df_merge['Comentario'] = str_list
df_merge

    Apellido  ...                                         Comentario
0    Andrade  ...  El empleado Andrade trabaja en el departamento...
1     Jordán  ...  El empleado Jordán trabaja en el departamento ...
2  Steinberg  ...  El empleado Steinberg trabaja en el departamen...
3   Róbinson  ...  El empleado Róbinson trabaja en el departament...
4     Zolano  ...  El empleado Zolano trabaja en el departamento ...
5     Gaspar  ...  El empleado Gaspar trabaja en el departamento ...

[6 rows x 6 columns]

### Concatenación de Series

In [ ]:
Ser1 = pd.Series([1,2], index=['a', 'b'])
Ser2 = pd.Series([2,3,4,5], index=['a', 'b', 'c', 'd'])

pd.concat([Ser1, Ser2], axis=0)

a    1
b    2
a    2
b    3
c    4
d    5
dtype: int64

In [ ]:
Ser1 = pd.Series([1,2], index=['a', 'b'])
Ser2 = pd.Series([2,3,4,5], index=['a', 'b', 'c', 'd'])
pd.concat([Ser1, Ser2], axis=1)

     0  1
a  1.0  2
b  2.0  3
c  NaN  4
d  NaN  5

## Concatenación de DataFrames

In [ ]:
df1 = pd.DataFrame({'var_1': [1,2], 'var_2': [3,4]})
df2 = pd.DataFrame({'var_3': [5,6], 'var_2': [7,8]})

pd.concat([df1, df2])

   var_1  var_2  var_3
0    1.0      3    NaN
1    2.0      4    NaN
0    NaN      7    5.0
1    NaN      8    6.0

In [ ]:
df1 = pd.DataFrame({'var_1': [1,2], 'var_2': [3,4]})
df2 = pd.DataFrame({'var_3': [5,6], 'var_2': [7,8]})

pd.concat([df1, df2], axis=1) # Es importante renombrar columnas

   var_1  var_2  var_3  var_2
0      1      3      5      7
1      2      4      6      8

In [ ]:
# Resultados raros
pd.concat([df1, df2], axis=1)['var_2']

   var_2  var_2
0      3      7
1      4      8

## Operaciones adicionales útiles con Pandas

### Multi-indexamiento

In [ ]:
import numpy as np
import pandas as pd

df_ventas = pd.DataFrame({'Oficina': [1,1,1,2,2,2,3,3,3,3],
                          'Producto': ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d'],
                          'Valor': np.random.randint(20, size=10)})
df_ventas

   Oficina Producto  Valor
0        1        a     18
1        1        b      1
2        1        c     12
3        2        a      8
4        2        b      6
5        2        c     19
6        3        a     17
7        3        b      1
8        3        c     15
9        3        d     19

In [ ]:
# Ventas de oficina 1
df_ventas[df_ventas['Oficina'] == 1]

   Oficina Producto  Valor
0        1        a     18
1        1        b      1
2        1        c     12

In [ ]:
# Ventas de oficinas 1 y 2
df_ventas[df_ventas['Oficina'].isin([1,2])]

   Oficina Producto  Valor
0        1        a     18
1        1        b      1
2        1        c     12
3        2        a      8
4        2        b      6
5        2        c     19

In [ ]:
df_ventas = pd.DataFrame({'Valor': np.random.random(10)},
                         index=[[1,1,1,2,2,2,3,3,3,3], 
                                ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d']])
# Se vuelve la oficina un índice
df_ventas = df_ventas.rename_axis(['Oficina','Producto'])
df_ventas

                     Valor
Oficina Producto
1       a         0.347043
        b         0.914267
        c         0.400664
2       a         0.641765
        b         0.906480
        c         0.023264
3       a         0.858902
        b         0.575298
        c         0.522716
        d         0.253971

In [ ]:
df_ventas.loc[1]

             Valor
Producto
a         0.347043
b         0.914267
c         0.400664

In [ ]:
df_ventas.loc[1:2]

                     Valor
Oficina Producto
1       a         0.347043
        b         0.914267
        c         0.400664
2       a         0.641765
        b         0.906480
        c         0.023264

### Intercambiando niveles de multi-indexamiento

In [ ]:
#df_ventas
df_ventas2 = df_ventas.swaplevel('Oficina','Producto')
df_ventas2

                     Valor
Producto Oficina
a        1        0.347043
b        1        0.914267
c        1        0.400664
a        2        0.641765
b        2        0.906480
c        2        0.023264
a        3        0.858902
b        3        0.575298
c        3        0.522716
d        3        0.253971

In [ ]:
df_ventas2.loc['a']

            Valor
Oficina
1        0.347043
2        0.641765
3        0.858902

### Agregaciones por nivel de indexamiento

In [ ]:
# Todas las ventas por oficina
df_ventas.sum(level='Oficina')

            Valor
Oficina
1        1.720458
2        1.528225
3        1.722589

In [ ]:
# # Todas las ventas por oficina
df_ventas.sum(level='Producto')

             Valor
Producto
a         1.639970
b         1.864463
c         1.355901
d         0.110937

### Tablas pivote

In [ ]:
df_ventas = pd.DataFrame({'Oficina': [1,1,1,2,2,2,3,3,3,3],
                          'Producto': ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d'],
                          'Valor': np.random.randint(20, size=10)})
df_ventas[df_ventas['Oficina'].isin([1,2])]

   Oficina Producto  Valor
0        1        a     13
1        1        b      3
2        1        c     17
3        2        a     10
4        2        b     19
5        2        c      9

In [ ]:
df_ventas.pivot(index='Oficina', columns='Producto', values='Valor')

Producto     a     b     c     d
Oficina
1         13.0   3.0  17.0   NaN
2         10.0  19.0   9.0   NaN
3          1.0   5.0   3.0  18.0

### Selección de sub dataframes por columna

In [ ]:
df_ventas['Producto']

0    a
1    b
2    c
3    a
4    b
5    c
6    a
7    b
8    c
9    d
Name: Producto, dtype: object

In [ ]:
df_ventas[['Producto', 'Valor']]

  Producto  Valor
0        a      2
1        b      9
2        c     17
3        a     12
4        b      0
5        c     12
6        a     19
7        b     17
8        c     16
9        d      9

### Ordenamientos

In [ ]:
Empleado.sort_values(by='IDDepartamento')

    Apellido  IDDepartamento  Edad  Edad_meses
0    Andrade              31    20         240
1     Jordán              33    23         276
2  Steinberg              33    45         540
3   Róbinson              34    48         576
4     Zolano              34    56         672
5     Gaspar              36    32         384

In [ ]:
Empleado.sort_values(by='IDDepartamento', ascending=False)

    Apellido  IDDepartamento  Edad  Edad_meses
5     Gaspar              36    32         384
3   Róbinson              34    48         576
4     Zolano              34    56         672
1     Jordán              33    23         276
2  Steinberg              33    45         540
0    Andrade              31    20         240

In [ ]:
Empleado.sort_values(by=['IDDepartamento', 'Apellido'], ascending=[False, False])

    Apellido  IDDepartamento  Edad  Edad_meses
5     Gaspar              36    32         384
4     Zolano              34    56         672
3   Róbinson              34    48         576
2  Steinberg              33    45         540
1     Jordán              33    23         276
0    Andrade              31    20         240

### Iteraciones sobre grupos

In [ ]:
# key: ID
# group: subDataframe
for key, group in Empleado.groupby('IDDepartamento'):
    print('=' * 50)
    print('IDDepartamento = {}'.format(key))
    print('-' * 50)
    print('DataFrame:')
    print(group)

==================================================
IDDepartamento = 31
--------------------------------------------------
DataFrame:
  Apellido  IDDepartamento  Edad  Edad_meses
0  Andrade              31    20         240
==================================================
IDDepartamento = 33
--------------------------------------------------
DataFrame:
    Apellido  IDDepartamento  Edad  Edad_meses
1     Jordán              33    23         276
2  Steinberg              33    45         540
==================================================
IDDepartamento = 34
--------------------------------------------------
DataFrame:
   Apellido  IDDepartamento  Edad  Edad_meses
3  Róbinson              34    48         576
4    Zolano              34    56         672
==================================================
IDDepartamento = 36
--------------------------------------------------
DataFrame:
  Apellido  IDDepartamento  Edad  Edad_meses
5   Gaspar              36    32         384

In [ ]:
# Se extrae solamente la columna 'apellido'
for key, group in Empleado.groupby('IDDepartamento')['Apellido']:
    print('=' * 50)
    print('IDDepartamento = {}'.format(key))
    print('-' * 50)
    print('DataFrame:')
    print(group)

==================================================
IDDepartamento = 31
--------------------------------------------------
DataFrame:
0    Andrade
Name: Apellido, dtype: object
==================================================
IDDepartamento = 33
--------------------------------------------------
DataFrame:
1       Jordán
2    Steinberg
Name: Apellido, dtype: object
==================================================
IDDepartamento = 34
--------------------------------------------------
DataFrame:
3    Róbinson
4      Zolano
Name: Apellido, dtype: object
==================================================
IDDepartamento = 36
--------------------------------------------------
DataFrame:
5    Gaspar
Name: Apellido, dtype: object

### Agrupamiento aplicando estadísticas desriptivas

In [ ]:
df_ventas = pd.DataFrame({'Oficina': np.random.choice([1, 2, 3], 50),
                          'Producto': np.random.choice(['a','b','c','d','e'], 50),
                          'Valor': np.random.randint(20, size=50)})

print(df_ventas)

    Oficina Producto  Valor
0         3        b     12
1         2        c      5
2         1        d      3
3         1        a     12
4         3        e     18
5         3        e      7
6         3        b      9
7         2        c      8
8         2        b     13
9         3        a     17
10        2        a     19
11        2        d     12
12        1        a      8
13        1        c      9
14        3        c      8
15        3        d     10
16        2        d     14
17        3        c      2
18        3        b      7
19        1        e      0
20        2        c     19
21        1        b      7
22        1        c      2
23        1        b      5
24        1        d      9
25        2        a     12
26        3        e      1
27        2        a     11
28        1        a     12
29        3        c     18
30        1        a      2
31        2        c      6
32        3        d      0
33        3        a      7
34        2        e      6
35        3        e      7
36        1        c     14
37        1        d     12
38        2        a      0
39        2        e      6
40        2        a      1
41        2        b     11
42        1        b      9
43        2        c      0
44        3        a      1
45        1        e     12
46        2        b     18
47        1        e      4
48        1        b      2
49        2        e      2

In [ ]:
df_ventas.groupby(['Oficina', 'Producto']).sum()

                  Valor
Oficina Producto
1       a            34
        b            23
        c            25
        d            24
        e            16
2       a            43
        b            42
        c            38
        d            26
        e            14
3       a            25
        b            28
        c            28
        d            10
        e            33

### Tablas cruzadas

In [ ]:
pd.crosstab(df_ventas['Oficina'], df_ventas['Producto'])

Producto  a  b  c  d  e
Oficina
1         4  4  3  3  3
2         5  3  5  2  3
3         3  3  3  2  4

In [ ]:
pd.crosstab(df_ventas['Oficina'], df_ventas['Producto'], margins=True)

Producto   a   b   c  d   e  All
Oficina
1          4   4   3  3   3   17
2          5   3   5  2   3   18
3          3   3   3  2   4   15
All       12  10  11  7  10   50